In [2]:
import numpy as np
import pandas as pd

In [6]:
diccionario = {"A": [4,5,np.nan], "B": [6,1,5], "C": [np.nan, 4, np.nan]}
diccionario

{'A': [4, 5, nan], 'B': [6, 1, 5], 'C': [nan, 4, nan]}

In [7]:
dataframe = pd.DataFrame(diccionario)
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [9]:
dataframe.dropna()

     A  B    C
1  5.0  1  4.0

In [10]:
dataframe.dropna(axis=1)

   B
0  6
1  1
2  5

In [11]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [12]:
dataframe.fillna(value=100)

       A  B      C
0    4.0  6  100.0
1    5.0  1    4.0
2  100.0  5  100.0

In [13]:
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

In [14]:
dataframe.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  1  4.0
2  4.5  5  4.0